src/Catalogs/РолиОборудования/РолиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиОборудования</name>
  <predefined>
    <items>
      <name>Apache</name>
      <description>Apache</description>
    </items>
    <items>
      <name>СерверIIS</name>
      <description>IIS</description>
    </items>
    <items>
      <name>СерверMSSQL</name>
      <description>MS SQL</description>
    </items>
    <items>
      <name>СерверPostgreSQL</name>
      <description>PostgreSQL</description>
    </items>
    <items>
      <name>ВиртуальнаяМашинаVMware</name>
      <description>Виртуальная машина VMware</description>
    </items>
    <items>
      <name>ВнешнийРесурс</name>
      <description>Внешний ресурс</description>
    </items>
    <items>
      <name>РабочийСервер1С</name>
      <description>Рабочий сервер 1С</description>
    </items>
    <items>
      <name>Сервер1СиMSSQL</name>
      <description>Сервер &quot;1С и MS SQL&quot;</description>
    </items>
    <items>
      <name>Сервер1СиPostgreSQL</name>
      <description>Сервер &quot;1С и PostgreSQL&quot;</description>
    </items>
    <items>
      <name>Сервер1СПредприятие</name>
      <description>Сервер &quot;1С:Предприятие&quot;</description>
    </items>
    <items>
      <name>СерверWindows</name>
      <description>Сервер c ОС Windows</description>
    </items>
    <items>
      <name>СерверLinux</name>
      <description>Сервер с ОС Linux</description>
    </items>
    <items>
      <name>ТерминальныйСервер</name>
      <description>Терминальный сервер</description>
    </items>
    <items>
      <name>Шлюз</name>
      <description>Шлюз</description>
    </items>
  </predefined>
  <attributes>
    <name>УдалитьСоздаватьКонтрольныеПроцедуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетчикиПроизводительности</name>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетчикиПроизводительностиLinux</name>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/СчетчикПроизводительностиПрименимо/СчетчикПроизводительностиПрименимо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СчетчикПроизводительностиПрименимо</name>
  <enumValues>
    <name>WindowsLinux</name>
  </enumValues>
  <enumValues>
    <name>Windows</name>
  </enumValues>
  <enumValues>
    <name>Linux</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/РолиОборудования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьПоШаблону(Очищать) Экспорт
    
    Если Очищать Тогда
        СчетчикиПроизводительности.Очистить();
        СчетчикиПроизводительностиLinux.Очистить();
    КонецЕсли;
	
	Счетчики = ПолучитьСчетчикиПоШаблонуНаСервере(Ссылка);
    
    Для Каждого ТекСчетчик Из Счетчики.Windows Цикл
        
        Если СчетчикиПроизводительности.Найти(ТекСчетчик, "СчетчикПроизводительности") = Неопределено Тогда
            НовСтрока = СчетчикиПроизводительности.Добавить();
            НовСтрока.СчетчикПроизводительности = ТекСчетчик;
        КонецЕсли;
        
    КонецЦикла;
    
    Для Каждого ТекСчетчик Из Счетчики.Linux Цикл
        
        Если СчетчикиПроизводительностиLinux.Найти(ТекСчетчик, "СчетчикПроизводительности") = Неопределено Тогда
            НовСтрока = СчетчикиПроизводительностиLinux.Добавить();
            НовСтрока.СчетчикПроизводительности = ТекСчетчик;
        КонецЕсли;
        
    КонецЦикла;
    
КонецПроцедуры

Функция ПолучитьСчетчикиПоШаблонуНаСервере(Ссылка)
    
    Счетчики = Новый Структура("Windows, Linux", Новый Массив, Новый Массив);
    
    Если Ссылка = Справочники.РолиОборудования.СерверWindows Тогда
        Счетчики.Windows = Справочники.РолиОборудования.ПолучитьСчетчикиПроизводительностиПредопределенного(Ссылка, Перечисления.СчетчикПроизводительностиПрименимо.Windows);
    ИначеЕсли Ссылка = Справочники.РолиОборудования.СерверLinux Тогда
        Счетчики.Linux = Справочники.РолиОборудования.ПолучитьСчетчикиПроизводительностиПредопределенного(Ссылка, Перечисления.СчетчикПроизводительностиПрименимо.Linux);
    ИначеЕсли Ссылка = Справочники.РолиОборудования.СерверMSSQL Тогда
        Счетчики.Windows = Справочники.РолиОборудования.ПолучитьСчетчикиПроизводительностиПредопределенного(Ссылка, Перечисления.СчетчикПроизводительностиПрименимо.Windows);
    КонецЕсли;
            
	Возврат Счетчики;
    
КонецФункции

#КонецЕсли
